{
  "architectures": [
    "GPTJXMoEForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration.GPTJXMoEConfig",
    "AutoModelForCausalLM": "modeling.GPTJXMoEForCausalLM"
  },
  "bias": false,
  "block_size": 32768,
  "dropout": 0.0,
  "expert_per_layer": {
    "0": 2,
    "1": 3,
    "2": 4,
    "3": 4,
    "4": 4,
    "5": 4,
    "6": 4,
    "7": 4,
    "8": 4,
    "9": 4,
    "10": 4,
    "11": 4
  },
  "kv_cache_dtype": "float32",
  "max_batch_size": 1,
  "model_type": "sabiyarn",
  "moe_dim": 3072,
  "n_embd": 768,
  "n_heads": 12,
  "n_layer": 12,
  "num_experts": 4,
  "num_experts_per_tok": 2,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.0",
  "use_kv_cache": true,
  "use_moe": true,
  "vocab_size": 52050
}
